{
  "backend/main.mo": "Empty Motoko actor serving as the backend entry point with no implemented functionality.",
  "feature_evidence.json": "Feature evidence report mapping each product feature (hero, nav, about, tokenomics, how-to-buy, etc.) to their implementing files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "JSON document containing one-line summaries of each frontend source file, describing their purpose and key contents.",
  "frontend/index.css": "Tailwind base CSS file defining OKLCH-based CSS custom properties for light and dark theme color tokens including background, foreground, card, border, and chart colors.",
  "frontend/index.html": "HTML entry point for the React app titled 'The Pointless Coin', mounting the app at the #root div and loading the main TSX module.",
  "frontend/src/App.tsx": "Root React component that assembles the full page by composing Navigation, HeroSection, TickerBanner, AboutSection, TokenomicsSection, HowToBuySection, RoadmapSection, CommunitySection, and Footer in order.",
  "frontend/src/components/AboutSection.tsx": "Two-column section featuring the coin image with floating badges and humorous meme-style copy explaining the coin's intentional lack of utility, with tag pills like 'No Utility' and '100% Vibes'.",
  "frontend/src/components/CommunitySection.tsx": "Community section with social platform cards for X, Telegram, and Discord plus a large CTA banner with Buy/Join buttons encouraging users to join the 'Pointless Army'.",
  "frontend/src/components/Footer.tsx": "Site footer with brand logo, quick-link navigation, social icon links, a legal disclaimer about meme coin risks, dynamic copyright year, and a caffeine.ai attribution link.",
  "frontend/src/components/HeroSection.tsx": "Renders the landing page hero section with a floating coin image, animated star particles, headline, ticker symbol, tagline, and CTA buttons that smooth-scroll to target sections.",
  "frontend/src/components/HowToBuySection.tsx": "Displays a four-step guide (create wallet, get ETH, swap on Uniswap, hold) for purchasing $POINTLESS, laid out in a responsive grid with icons and connector lines.",
  "frontend/src/components/Navigation.tsx": "Fixed top navigation bar with smooth-scroll links, a logo, a 'Buy $POINTLESS' CTA button, and a collapsible mobile menu that gains a backdrop blur on scroll.",
  "frontend/src/components/RoadmapSection.tsx": "Shows a four-phase roadmap (complete, active, upcoming, upcoming) in a two-column grid, each card listing milestone items with status badges and humorous notes.",
  "frontend/src/components/TickerBanner.tsx": "Horizontally scrolling marquee banner that continuously displays repeated $POINTLESS promotional slogans using a CSS ticker animation.",
  "frontend/src/components/TokenomicsSection.tsx": "Presents four key tokenomics stats (1B supply, 0% tax, 100% liquidity locked, 0% team allocation) in a card grid alongside a copyable contract address display.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that creates and caches an ICP backend actor (anonymous or authenticated) using React Query, and invalidates dependent queries whenever the actor or identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication on the ICP platform, managing login state, identity persistence, and AuthClient lifecycle.",
  "frontend/src/index.css": "Global stylesheet importing Google Fonts and Tailwind directives, defining CSS custom properties for a dark gold-themed design system with utility classes for glow effects, buttons, and cards.",
  "frontend/src/main.tsx": "React app entry point that mounts the root component wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the theme with oklch-based gold/dark color palettes, custom fonts, box shadows, and keyframe animations for a meme coin UI.",
  "project_state.json": "Project state manifest describing the 'The Pointless Coin' meme coin website build, listing implemented features, architectural notes, known issues, and image requirements."
}