{
  "kind": "build_request",
  "title": "Remove Discord & Telegram from Community section; replace with single X Communities link",
  "projectName": "The Pointless Coin",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-22",
      "text": "Update the CommunitySection component to remove the Discord card and the Telegram card entirely. Replace them with a single X (Twitter) Communities card linking to https://x.com/i/communities/2027059335088521312. The card should follow the same bold social card style as the existing cards. Update any CTA copy or descriptive text accordingly so there are no remaining references to Discord or Telegram in the section.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "remove the discord option make this link the X directory https://x.com/i/communities/2027059335088521312 remove the telgram also"
        ]
      },
      "acceptanceCriteria": [
        "The Discord social card is no longer visible in the CommunitySection.",
        "The Telegram social card is no longer visible in the CommunitySection.",
        "A single X Communities card is displayed, linking to https://x.com/i/communities/2027059335088521312.",
        "The X Communities card uses the same bold card style as the rest of the section.",
        "No references to Discord or Telegram remain in the CommunitySection component.",
        "The Footer social icon links also have Discord and Telegram icons removed, with only the X link retained."
      ]
    }
  ],
  "constraints": [
    "Do not modify any files listed in frontend.immutablePaths.",
    "Preserve all other sections and components unchanged.",
    "The X Communities URL https://x.com/i/communities/2027059335088521312 must be used exactly as provided."
  ],
  "nonGoals": [
    "Adding any new social platforms beyond the X Communities link.",
    "Changing the visual theme or layout of the Community section beyond removing the two cards.",
    "Modifying any other sections (Hero, About, Tokenomics, HowToBuy, Navigation, Footer beyond social icons).",
    "Backend changes."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}