{
  "kind": "build_request",
  "title": "The Pointless Coin – Meme Coin Website (theuselesscoin.com replica)",
  "projectName": "The Pointless Coin",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Create a full-page hero section with a large animated coin logo (using the generated coin image), the headline 'THE POINTLESS COIN', a punchy meme-style tagline (e.g. 'Absolutely no utility. Completely pointless. 100% yours.'), and two CTA buttons: 'Buy Now' and 'Join Community'.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-2"
        ],
        "quotes": [
          "make the site exactly the same but make it the pointless coin"
        ]
      },
      "acceptanceCriteria": [
        "Hero section occupies full viewport height on load",
        "Coin image is displayed prominently and rotates or bobs with a CSS animation",
        "Headline reads 'THE POINTLESS COIN' in large display typography",
        "Two CTA buttons are visible and styled consistently with the theme"
      ]
    },
    {
      "id": "REQ-2",
      "text": "Create a sticky navigation bar with the coin logo, the name 'The Pointless Coin', and anchor links to all page sections (e.g. About, Tokenomics, How to Buy, Roadmap, Community).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-2"
        ],
        "quotes": [
          "make the site exactly the same"
        ]
      },
      "acceptanceCriteria": [
        "Nav stays fixed at top on scroll",
        "All anchor links scroll smoothly to their respective sections",
        "Logo and name are visible in the nav bar"
      ]
    },
    {
      "id": "REQ-3",
      "text": "Create an 'About' section explaining the coin in a humorous, self-aware meme style — emphasising that The Pointless Coin has no utility, no roadmap promises, and no serious purpose, just like the original theuselesscoin.com framing.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-2"
        ],
        "quotes": [
          "this was a meme coins site that went to 200m cap"
        ]
      },
      "acceptanceCriteria": [
        "Section has a clear heading 'About' or 'What is The Pointless Coin?'",
        "Copy is written in a humorous, ironic meme-coin voice",
        "Coin image is used as a visual element alongside the text"
      ]
    },
    {
      "id": "REQ-4",
      "text": "Create a 'Tokenomics' section displaying key stats (total supply, tax, liquidity lock, etc.) in a visually bold card or grid layout with meme-style labelling (e.g. '1 Billion Supply — Because why not').",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-2"
        ],
        "quotes": [
          "make the site exactly the same"
        ]
      },
      "acceptanceCriteria": [
        "At least 4 tokenomics stats are displayed",
        "Stats are presented in cards or a prominent grid",
        "Labels use the humorous meme-coin tone"
      ]
    },
    {
      "id": "REQ-5",
      "text": "Create a 'How to Buy' section with numbered steps (e.g. Create a wallet → Get ETH/SOL → Swap for $POINTLESS → Hold and do nothing) including icons or illustrations for each step.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-2"
        ],
        "quotes": [
          "make the site exactly the same"
        ]
      },
      "acceptanceCriteria": [
        "Section contains at least 4 numbered steps",
        "Each step has an icon or visual element",
        "Steps are written in a clear, beginner-friendly but humorous tone"
      ]
    },
    {
      "id": "REQ-6",
      "text": "Create a 'Roadmap' section presented as a satirical timeline with milestones that poke fun at typical crypto roadmaps (e.g. Phase 1: Launch. Phase 2: Go up. Phase 3: We figure it out. Phase 4: Moon?).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-2"
        ],
        "quotes": [
          "make the site exactly the same"
        ]
      },
      "acceptanceCriteria": [
        "Timeline or phase layout with at least 4 phases",
        "Milestones are written in a satirical meme tone",
        "Layout is visually distinct from other sections"
      ]
    },
    {
      "id": "REQ-7",
      "text": "Create a 'Community' section with links/buttons to social platforms (Twitter/X, Telegram, Discord) styled as large, bold social cards, and a fun call-to-action encouraging users to join.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-2"
        ],
        "quotes": [
          "make the site exactly the same"
        ]
      },
      "acceptanceCriteria": [
        "At least 3 social platform links are displayed",
        "Each link has an icon and label",
        "Section includes a call-to-action headline"
      ]
    },
    {
      "id": "REQ-8",
      "text": "Create a footer with the coin name, a short disclaimer ('This is a meme coin with no intrinsic value or financial utility'), copyright notice, and social links.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-2"
        ],
        "quotes": [
          "make the site exactly the same"
        ]
      },
      "acceptanceCriteria": [
        "Footer is present at the bottom of the page",
        "Disclaimer text is included",
        "Copyright and social links are present"
      ]
    },
    {
      "id": "REQ-9",
      "text": "Apply a bold, high-contrast meme-coin visual theme throughout the site: deep black background, vibrant yellow/gold accent color to reflect the coin branding, large chunky display fonts, glowing or neon effects on key elements, and playful micro-animations (e.g. coin spin, button hover glow). The overall aesthetic should feel energetic, irreverent, and viral.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-2"
        ],
        "quotes": [
          "make the site exactly the same"
        ]
      },
      "acceptanceCriteria": [
        "Background is deep black or very dark",
        "Primary accent color is gold or vibrant yellow",
        "Display headings use a bold, impactful font",
        "At least one element has a glow or neon effect",
        "Coin image has a spin or float animation in the hero"
      ]
    },
    {
      "id": "REQ-10",
      "text": "Use the generated coin image (pointless-coin.dim_512x512.png) as the primary coin visual throughout the site — in the hero, the nav logo, the about section, and any other relevant locations.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-2"
        ],
        "quotes": [
          "use the photo i give you for the coin"
        ]
      },
      "acceptanceCriteria": [
        "Coin image is displayed in the hero section",
        "A smaller version is used as the nav logo",
        "Image is loaded from frontend/public/assets/generated/pointless-coin.dim_512x512.png"
      ]
    }
  ],
  "constraints": [
    "No backend data persistence is required — the site is fully static/frontend only",
    "All social links can use placeholder '#' hrefs since real URLs have not been provided",
    "Do not copy any actual code or assets from theuselesscoin.com — only replicate the layout/structure concept"
  ],
  "nonGoals": [
    "No real token contract integration or blockchain connectivity",
    "No wallet connection (MetaMask, WalletConnect, etc.)",
    "No price ticker or live market data feeds",
    "No backend canister logic",
    "No user authentication"
  ],
  "imageRequirements": {
    "required": [
      "A shiny gold coin with a bold letter 'P' embossed in the center, cartoon-style with a gleaming metallic finish and a slight comic glow effect around the edge, circular format (pointless-coin.dim_512x512.png)"
    ],
    "edits": []
  }
}