{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Remove all 'Liquidity Locked' references site-wide",
  "requirements": [
    {
      "id": "REQ-24",
      "summary": "Audit all frontend components and remove every visible instance of 'Liquidity Locked', 'liquidity locked', 'liq locked', or any equivalent phrasing referencing a liquidity lock from TokenomicsSection, TickerBanner, HeroSection, AboutSection, HowToBuySection, Navigation, CommunitySection, Footer, and any other files",
      "acceptanceCriteria": [
        "No instance of 'Liquidity Locked', 'liquidity locked', or equivalent phrasing appears anywhere on the rendered site",
        "TokenomicsSection contains no liquidity locked card, badge, or text",
        "TickerBanner contains no liquidity locked phrase",
        "All other components (HeroSection, AboutSection, HowToBuySection, Navigation, CommunitySection, Footer) contain no liquidity locked text",
        "The layout of any section that previously contained a liquidity locked element reflows cleanly without visual gaps or broken grids"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/TokenomicsSection.tsx",
          "operation": "modify",
          "description": "Remove any card, badge, label, or text element displaying 'Liquidity Locked', 'liquidity locked', or equivalent phrasing. Remove the entire card/element from the rendered output. Ensure the remaining tokenomics cards (supply, team allocation, contract address) reflow cleanly in the grid without visual gaps."
        },
        {
          "path": "frontend/src/components/TickerBanner.tsx",
          "operation": "modify",
          "description": "Remove any ticker phrase or text segment containing 'Liquidity Locked', 'liquidity locked', 'liq locked', or equivalent wording from the scrolling marquee. Ensure the remaining ticker phrases continue to scroll seamlessly without gaps."
        },
        {
          "path": "frontend/src/components/HeroSection.tsx",
          "operation": "modify",
          "description": "Audit and remove any instance of 'Liquidity Locked', 'liquidity locked', or equivalent phrasing from headlines, taglines, body text, badges, or tooltips. Ensure the hero layout remains intact."
        },
        {
          "path": "frontend/src/components/AboutSection.tsx",
          "operation": "modify",
          "description": "Audit and remove any instance of 'Liquidity Locked', 'liquidity locked', or equivalent phrasing from the about copy, tag pills, orbiting badges, or any other text elements. Ensure the two-column layout and floating coin remain visually balanced."
        },
        {
          "path": "frontend/src/components/HowToBuySection.tsx",
          "operation": "modify",
          "description": "Audit and remove any instance of 'Liquidity Locked', 'liquidity locked', or equivalent phrasing from step descriptions, tips, or any other text content. Ensure the three-step guide layout remains intact."
        },
        {
          "path": "frontend/src/components/Navigation.tsx",
          "operation": "modify",
          "description": "Audit and remove any instance of 'Liquidity Locked', 'liquidity locked', or equivalent phrasing from navigation links, button labels, tooltips, or mobile menu items. Ensure navigation functionality and styling remain intact."
        },
        {
          "path": "frontend/src/components/CommunitySection.tsx",
          "operation": "modify",
          "description": "Audit and remove any instance of 'Liquidity Locked', 'liquidity locked', or equivalent phrasing from social card text, CTA banner copy, button labels, or any other text elements. Ensure the community layout and CTAs remain functional."
        },
        {
          "path": "frontend/src/components/Footer.tsx",
          "operation": "modify",
          "description": "Audit and remove any instance of 'Liquidity Locked', 'liquidity locked', or equivalent phrasing from footer links, disclaimer text, copyright line, or any other text content. Ensure the footer layout remains intact."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Audit the root component for any inline text, comments, or props that reference 'Liquidity Locked' or equivalent phrasing and remove them. Verify that all child section components are rendered correctly after their individual updates."
        }
      ]
    }
  ]
}